# 자료형
# 1. 리스트

a = [1,2,3,4,5]
b = [1,2,3,'a','b']

print(b) # [1, 2, 3, 'a', 'b']
# 리스트에서는 여러가지 자료를 사용 가능하지만
# numpy에는 꼭 한가지 자료만을 사용해야함

print(a[0] + a[3]) # 5
# print(b[0] + b[3])

print(type(a)) # list
print(a[-2]) # 
print(a[1:3])

print("===========================================================")
a = [1, 2, 3, ['a', 'b', 'c']]
print(a[1])
print(a[-1])
print(a[-1][1])

print("===========================================================")

# 1.2 인덱스 슬라이싱

a = [1,2,3,4,5]
print(a[:2]) # 1, 2
print("===========================================================")

# 1-3 리스트 더하기

a = [1, 2, 3]
b = [4, 5, 6]
print(a + b) # 1, 2, 3, 4, 5, 6
print("===========================================================")

c = [7,8,9,10]
print(a+c)

print(a * 3) # [1,2,3,1,2,3,1,2,3]
# print(a[2] + 'hi') # 정수와 글자 당연히 오류
print(str(a[2]) + 'hi')

f = '5'
print(a[2] + int(f))
print("===========================================================")

# 리스트 관련 함수

a = [1,2,3]
a.append(4) # 리스트에 4추가
print(a)
# a = a.append(5) # 오오류우 문법상의 오류
print("===========================================================")

a = [1,3,2,4]
a.sort() # 정렬
print(a) 
print("===========================================================")

a.reverse()
print(a) # 거꾸로 [4,3,2,1]
print(a.index(3)) # = a[3]
print("===========================================================")

a. insert(0,7) # 0자리에 7을 삽입
a. insert(3,3) # 세번재 자리의 3을 추가
print(a)
print("===========================================================")

a.remove(7) # 7을 삭제한다.
print(a)
a.remove(3) # 데이터 안의 3이 두개지만 앞에 있는 것 먼저 삭제 
print(a)
print("===========================================================")


